tianditu/SHUSensorPlatform/examples/requests_soap/GetFoi_foiID_soap_12.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:sos="http://www.opengis.net/sos/1.0"
	xmlns:ows="http://www.opengis.net/ows/1.1">
	<env:Body>
		<sos:GetFeatureOfInterest service="SOS"
			version="1.0.0" xmlns:ows="http://www.opengeospatial.net/ows"
			xmlns:gml="http://www.opengis.net/gml" xmlns:ogc="http://www.opengis.net/ogc"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/1.0
	http://schemas.opengis.net/sos/1.0.0/sosGetFeatureOfInterest.xsd">
			<sos:FeatureOfInterestId>foi_1001</sos:FeatureOfInterestId>
		</sos:GetFeatureOfInterest>
	</env:Body>
</env:Envelope>