modules/testing/data/src/main/resources/org/constellation/xml/sos/GetFeatureOfInterestSOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope
	http://www.w3.org/2003/05/soap-envelope">
	<soap:Body>
		<GetFeatureOfInterest xmlns="http://www.opengis.net/sos/1.0" service="SOS" version="1.0.0">
                    <FeatureOfInterestId>station-001</FeatureOfInterestId>
                </GetFeatureOfInterest>
	</soap:Body>
</soap:Envelope>
