.svn/pristine/78/78139c695295f04efe5b33d670a8d0d17a7e2583.svn-base

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:sos="http://www.opengis.net/sos/1.0"
	xmlns:ows="http://www.opengis.net/ows/1.1">
	<env:Header>
		<wsa:To>http://www.52north.org/services/sos</wsa:To>
		<wsa:Action>http://www.opengis.net/sos/1.0#DescribeSensor</wsa:Action>
		<wsa:ReplyTo>
			<wsa:AddressTo>http://my.client.com/client/myReceiver</wsa:AddressTo>
		</wsa:ReplyTo>
	</env:Header>
	<env:Body>
		<sos:DescribeSensor version="1.0.0" service="SOS"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/1.0
	http://schemas.opengis.net/sos/1.0.0/sosDescribeSensor.xsd"
			outputFormat="text/xml;subtype=&quot;sensorML/1.0.1&quot;">
			<sos:procedure>urn:ogc:object:feature:Sensor:IFGI:ifgi-sensor-1
			</sos:procedure>
		</sos:DescribeSensor>
	</env:Body>
</env:Envelope>