.svn/pristine/8b/8b1357de78a6cb83a6f79fd4f14568e54d57b510.svn-base

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:sos="http://www.opengis.net/sos/1.0"
	xmlns:ows="http://www.opengis.net/ows/1.1">
	<env:Header>
		<wsa:To>http://www.52north.org/services/sos</wsa:To>
		<wsa:Action>http://www.opengis.net/sos/1.0#GetFeatureOfInterest
		</wsa:Action>
		<wsa:ReplyTo>
			<wsa:AddressTo>http://my.client.com/client/myReceiver</wsa:AddressTo>
		</wsa:ReplyTo>
	</env:Header>
	<env:Body>
		<sos:GetFeatureOfInterest service="SOS"
			version="1.0.0" xmlns:ows="http://www.opengeospatial.net/ows"
			xmlns:gml="http://www.opengis.net/gml" xmlns:ogc="http://www.opengis.net/ogc"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/1.0
	http://schemas.opengis.net/sos/1.0.0/sosGetFeatureOfInterest.xsd">
			<sos:FeatureOfInterestId>foi_1001</sos:FeatureOfInterestId>
		</sos:GetFeatureOfInterest>
	</env:Body>
</env:Envelope>