.svn/pristine/4d/4dfa7af5e618f59e314b3976bdb80a156c55ac0f.svn-base

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:sos="http://www.opengis.net/sos/1.0"
			xmlns:ows="http://www.opengis.net/ows/1.1">
	<env:Header>
		<wsa:To>http://www.52north.org/services/sos</wsa:To>
		<wsa:Action>http://www.opengis.net/sos/1.0#GetCapabilities
		</wsa:Action>
		<wsa:ReplyTo>
			<wsa:AddressTo>http://my.client.com/client/myReceiver</wsa:AddressTo>
		</wsa:ReplyTo>
	</env:Header>
	<env:Body>
		<sos:GetCapabilities>
			<ows:AcceptVersions>
				<ows:Version>1.0.0</ows:Version>
			</ows:AcceptVersions>
			<ows:Sections>
				<ows:Section>OperationsMetadata</ows:Section>
				<ows:Section>ServiceIdentification</ows:Section>
				<ows:Section>ServiceProvider</ows:Section>
				<ows:Section>Filter_Capabilities</ows:Section>
				<ows:Section>Contents</ows:Section>
			</ows:Sections>
		</sos:GetCapabilities>
	</env:Body>
</env:Envelope>