52n-sos-service/src/main/webapp/examples/requests_soap/GetObs_basic_soap_12.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:sos="http://www.opengis.net/sos/1.0"
	xmlns:ows="http://www.opengis.net/ows/1.1">
	<env:Header>
		<wsa:To>http://www.52north.org/services/sos</wsa:To>
		<wsa:Action>http://www.opengis.net/sos/1.0#GetObservation</wsa:Action>
		<wsa:ReplyTo>
			<wsa:AddressTo>http://my.client.com/client/myReceiver</wsa:AddressTo>
		</wsa:ReplyTo>
	</env:Header>
	<env:Body>
		<sos:GetObservation xmlns="http://www.opengis.net/sos/1.0"
			xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:gml="http://www.opengis.net/gml"
			xmlns:ogc="http://www.opengis.net/ogc" xmlns:om="http://www.opengis.net/om/1.0"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/1.0
	http://schemas.opengis.net/sos/1.0.0/sosGetObservation.xsd"
			service="SOS" version="1.0.0" srsName="urn:ogc:def:crs:EPSG:4326">
			<sos:offering>GAUGE_HEIGHT</sos:offering>
			<sos:observedProperty>urn:ogc:def:phenomenon:OGC:1.0.30:waterlevel</sos:observedProperty>
			<sos:responseFormat>text/xml;subtype=&quot;om/1.0.0&quot;</sos:responseFormat>
		</sos:GetObservation>
	</env:Body>
</env:Envelope>